Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMinimcds_bf.h
/**
 * \file IfxMinimcds_bf.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 *
 * Date: 2015-12-17 16:15:04 GMT
 * Version: TBD
 * Specification: TBD
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Minimcds_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxLld_Minimcds_Registers
 * 
 */
#ifndef IFXMINIMCDS_BF_H
#define IFXMINIMCDS_BF_H 1
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Minimcds_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_MINIMCDS_CLC_Bits.DISR */
#define IFX_MINIMCDS_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_CLC_Bits.DISR */
#define IFX_MINIMCDS_CLC_DISR_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_CLC_Bits.DISR */
#define IFX_MINIMCDS_CLC_DISR_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_CLC_Bits.DISS */
#define IFX_MINIMCDS_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_CLC_Bits.DISS */
#define IFX_MINIMCDS_CLC_DISS_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_CLC_Bits.DISS */
#define IFX_MINIMCDS_CLC_DISS_OFF (1u)

/** \brief Length for Ifx_MINIMCDS_OCS_Bits.SUS */
#define IFX_MINIMCDS_OCS_SUS_LEN (4u)

/** \brief Mask for Ifx_MINIMCDS_OCS_Bits.SUS */
#define IFX_MINIMCDS_OCS_SUS_MSK (0xfu)

/** \brief Offset for Ifx_MINIMCDS_OCS_Bits.SUS */
#define IFX_MINIMCDS_OCS_SUS_OFF (24u)

/** \brief Length for Ifx_MINIMCDS_OCS_Bits.SUS_P */
#define IFX_MINIMCDS_OCS_SUS_P_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_OCS_Bits.SUS_P */
#define IFX_MINIMCDS_OCS_SUS_P_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_OCS_Bits.SUS_P */
#define IFX_MINIMCDS_OCS_SUS_P_OFF (28u)

/** \brief Length for Ifx_MINIMCDS_OCS_Bits.SUSSTA */
#define IFX_MINIMCDS_OCS_SUSSTA_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_OCS_Bits.SUSSTA */
#define IFX_MINIMCDS_OCS_SUSSTA_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_OCS_Bits.SUSSTA */
#define IFX_MINIMCDS_OCS_SUSSTA_OFF (29u)

/** \brief Length for Ifx_MINIMCDS_ID_Bits.MOD_REV */
#define IFX_MINIMCDS_ID_MOD_REV_LEN (8u)

/** \brief Mask for Ifx_MINIMCDS_ID_Bits.MOD_REV */
#define IFX_MINIMCDS_ID_MOD_REV_MSK (0xffu)

/** \brief Offset for Ifx_MINIMCDS_ID_Bits.MOD_REV */
#define IFX_MINIMCDS_ID_MOD_REV_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_ID_Bits.MOD_TYPE */
#define IFX_MINIMCDS_ID_MOD_TYPE_LEN (8u)

/** \brief Mask for Ifx_MINIMCDS_ID_Bits.MOD_TYPE */
#define IFX_MINIMCDS_ID_MOD_TYPE_MSK (0xffu)

/** \brief Offset for Ifx_MINIMCDS_ID_Bits.MOD_TYPE */
#define IFX_MINIMCDS_ID_MOD_TYPE_OFF (8u)

/** \brief Length for Ifx_MINIMCDS_ID_Bits.MOD_NUMBER */
#define IFX_MINIMCDS_ID_MOD_NUMBER_LEN (16u)

/** \brief Mask for Ifx_MINIMCDS_ID_Bits.MOD_NUMBER */
#define IFX_MINIMCDS_ID_MOD_NUMBER_MSK (0xffffu)

/** \brief Offset for Ifx_MINIMCDS_ID_Bits.MOD_NUMBER */
#define IFX_MINIMCDS_ID_MOD_NUMBER_OFF (16u)

/** \brief Length for Ifx_MINIMCDS_CT_Bits.KOK */
#define IFX_MINIMCDS_CT_KOK_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_CT_Bits.KOK */
#define IFX_MINIMCDS_CT_KOK_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_CT_Bits.KOK */
#define IFX_MINIMCDS_CT_KOK_OFF (5u)

/** \brief Length for Ifx_MINIMCDS_CT_Bits.KAV */
#define IFX_MINIMCDS_CT_KAV_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_CT_Bits.KAV */
#define IFX_MINIMCDS_CT_KAV_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_CT_Bits.KAV */
#define IFX_MINIMCDS_CT_KAV_OFF (7u)

/** \brief Length for Ifx_MINIMCDS_CT_Bits.EN */
#define IFX_MINIMCDS_CT_EN_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_CT_Bits.EN */
#define IFX_MINIMCDS_CT_EN_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_CT_Bits.EN */
#define IFX_MINIMCDS_CT_EN_OFF (13u)

/** \brief Length for Ifx_MINIMCDS_CT_Bits.CLRE */
#define IFX_MINIMCDS_CT_CLRE_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_CT_Bits.CLRE */
#define IFX_MINIMCDS_CT_CLRE_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_CT_Bits.CLRE */
#define IFX_MINIMCDS_CT_CLRE_OFF (14u)

/** \brief Length for Ifx_MINIMCDS_CT_Bits.SETE */
#define IFX_MINIMCDS_CT_SETE_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_CT_Bits.SETE */
#define IFX_MINIMCDS_CT_SETE_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_CT_Bits.SETE */
#define IFX_MINIMCDS_CT_SETE_OFF (15u)

/** \brief Length for Ifx_MINIMCDS_CT_Bits.BED */
#define IFX_MINIMCDS_CT_BED_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_CT_Bits.BED */
#define IFX_MINIMCDS_CT_BED_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_CT_Bits.BED */
#define IFX_MINIMCDS_CT_BED_OFF (16u)

/** \brief Length for Ifx_MINIMCDS_CT_Bits.BED_P */
#define IFX_MINIMCDS_CT_BED_P_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_CT_Bits.BED_P */
#define IFX_MINIMCDS_CT_BED_P_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_CT_Bits.BED_P */
#define IFX_MINIMCDS_CT_BED_P_OFF (19u)

/** \brief Length for Ifx_MINIMCDS_CT_Bits.IRA */
#define IFX_MINIMCDS_CT_IRA_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_CT_Bits.IRA */
#define IFX_MINIMCDS_CT_IRA_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_CT_Bits.IRA */
#define IFX_MINIMCDS_CT_IRA_OFF (21u)

/** \brief Length for Ifx_MINIMCDS_CT_Bits.CLRI */
#define IFX_MINIMCDS_CT_CLRI_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_CT_Bits.CLRI */
#define IFX_MINIMCDS_CT_CLRI_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_CT_Bits.CLRI */
#define IFX_MINIMCDS_CT_CLRI_OFF (22u)

/** \brief Length for Ifx_MINIMCDS_CT_Bits.IWA */
#define IFX_MINIMCDS_CT_IWA_LEN (1u)

