Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMinimcds_bf.h
/** \brief Mask for Ifx_MINIMCDS_CT_Bits.IWA */
#define IFX_MINIMCDS_CT_IWA_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_CT_Bits.IWA */
#define IFX_MINIMCDS_CT_IWA_OFF (23u)

/** \brief Length for Ifx_MINIMCDS_CT_Bits.RES */
#define IFX_MINIMCDS_CT_RES_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_CT_Bits.RES */
#define IFX_MINIMCDS_CT_RES_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_CT_Bits.RES */
#define IFX_MINIMCDS_CT_RES_OFF (29u)

/** \brief Length for Ifx_MINIMCDS_CT_Bits.SETR */
#define IFX_MINIMCDS_CT_SETR_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_CT_Bits.SETR */
#define IFX_MINIMCDS_CT_SETR_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_CT_Bits.SETR */
#define IFX_MINIMCDS_CT_SETR_OFF (31u)

/** \brief Length for Ifx_MINIMCDS_MUX_Bits.TMUX0 */
#define IFX_MINIMCDS_MUX_TMUX0_LEN (4u)

/** \brief Mask for Ifx_MINIMCDS_MUX_Bits.TMUX0 */
#define IFX_MINIMCDS_MUX_TMUX0_MSK (0xfu)

/** \brief Offset for Ifx_MINIMCDS_MUX_Bits.TMUX0 */
#define IFX_MINIMCDS_MUX_TMUX0_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_MUX_Bits.TM_P0 */
#define IFX_MINIMCDS_MUX_TM_P0_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_MUX_Bits.TM_P0 */
#define IFX_MINIMCDS_MUX_TM_P0_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_MUX_Bits.TM_P0 */
#define IFX_MINIMCDS_MUX_TM_P0_OFF (7u)

/** \brief Length for Ifx_MINIMCDS_MUX_Bits.TMUX1 */
#define IFX_MINIMCDS_MUX_TMUX1_LEN (4u)

/** \brief Mask for Ifx_MINIMCDS_MUX_Bits.TMUX1 */
#define IFX_MINIMCDS_MUX_TMUX1_MSK (0xfu)

/** \brief Offset for Ifx_MINIMCDS_MUX_Bits.TMUX1 */
#define IFX_MINIMCDS_MUX_TMUX1_OFF (8u)

/** \brief Length for Ifx_MINIMCDS_MUX_Bits.TM_P1 */
#define IFX_MINIMCDS_MUX_TM_P1_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_MUX_Bits.TM_P1 */
#define IFX_MINIMCDS_MUX_TM_P1_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_MUX_Bits.TM_P1 */
#define IFX_MINIMCDS_MUX_TM_P1_OFF (15u)

/** \brief Length for Ifx_MINIMCDS_MUX_Bits.TMUX2 */
#define IFX_MINIMCDS_MUX_TMUX2_LEN (4u)

/** \brief Mask for Ifx_MINIMCDS_MUX_Bits.TMUX2 */
#define IFX_MINIMCDS_MUX_TMUX2_MSK (0xfu)

/** \brief Offset for Ifx_MINIMCDS_MUX_Bits.TMUX2 */
#define IFX_MINIMCDS_MUX_TMUX2_OFF (16u)

/** \brief Length for Ifx_MINIMCDS_MUX_Bits.TM_P2 */
#define IFX_MINIMCDS_MUX_TM_P2_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_MUX_Bits.TM_P2 */
#define IFX_MINIMCDS_MUX_TM_P2_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_MUX_Bits.TM_P2 */
#define IFX_MINIMCDS_MUX_TM_P2_OFF (23u)

/** \brief Length for Ifx_MINIMCDS_MUX_Bits.TMUX3 */
#define IFX_MINIMCDS_MUX_TMUX3_LEN (4u)

/** \brief Mask for Ifx_MINIMCDS_MUX_Bits.TMUX3 */
#define IFX_MINIMCDS_MUX_TMUX3_MSK (0xfu)

/** \brief Offset for Ifx_MINIMCDS_MUX_Bits.TMUX3 */
#define IFX_MINIMCDS_MUX_TMUX3_OFF (24u)

/** \brief Length for Ifx_MINIMCDS_MUX_Bits.TM_P3 */
#define IFX_MINIMCDS_MUX_TM_P3_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_MUX_Bits.TM_P3 */
#define IFX_MINIMCDS_MUX_TM_P3_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_MUX_Bits.TM_P3 */
#define IFX_MINIMCDS_MUX_TM_P3_OFF (31u)

/** \brief Length for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_MUX0 */
#define IFX_MINIMCDS_MUX_TC_RC_TC_MUX0_LEN (2u)

/** \brief Mask for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_MUX0 */
#define IFX_MINIMCDS_MUX_TC_RC_TC_MUX0_MSK (0x3u)

/** \brief Offset for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_MUX0 */
#define IFX_MINIMCDS_MUX_TC_RC_TC_MUX0_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_MUX1 */
#define IFX_MINIMCDS_MUX_TC_RC_TC_MUX1_LEN (2u)

/** \brief Mask for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_MUX1 */
#define IFX_MINIMCDS_MUX_TC_RC_TC_MUX1_MSK (0x3u)

/** \brief Offset for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_MUX1 */
#define IFX_MINIMCDS_MUX_TC_RC_TC_MUX1_OFF (2u)

/** \brief Length for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_MUX2 */
#define IFX_MINIMCDS_MUX_TC_RC_TC_MUX2_LEN (2u)

/** \brief Mask for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_MUX2 */
#define IFX_MINIMCDS_MUX_TC_RC_TC_MUX2_MSK (0x3u)

/** \brief Offset for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_MUX2 */
#define IFX_MINIMCDS_MUX_TC_RC_TC_MUX2_OFF (4u)

/** \brief Length for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_MUX3 */
#define IFX_MINIMCDS_MUX_TC_RC_TC_MUX3_LEN (2u)

/** \brief Mask for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_MUX3 */
#define IFX_MINIMCDS_MUX_TC_RC_TC_MUX3_MSK (0x3u)

/** \brief Offset for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_MUX3 */
#define IFX_MINIMCDS_MUX_TC_RC_TC_MUX3_OFF (6u)

/** \brief Length for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_MUX4 */
#define IFX_MINIMCDS_MUX_TC_RC_TC_MUX4_LEN (2u)

/** \brief Mask for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_MUX4 */
#define IFX_MINIMCDS_MUX_TC_RC_TC_MUX4_MSK (0x3u)

/** \brief Offset for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_MUX4 */
#define IFX_MINIMCDS_MUX_TC_RC_TC_MUX4_OFF (8u)

/** \brief Length for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_MUX5 */
#define IFX_MINIMCDS_MUX_TC_RC_TC_MUX5_LEN (2u)

/** \brief Mask for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_MUX5 */
#define IFX_MINIMCDS_MUX_TC_RC_TC_MUX5_MSK (0x3u)

/** \brief Offset for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_MUX5 */
#define IFX_MINIMCDS_MUX_TC_RC_TC_MUX5_OFF (10u)

/** \brief Length for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_TM_P */
#define IFX_MINIMCDS_MUX_TC_RC_TC_TM_P_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_TM_P */
#define IFX_MINIMCDS_MUX_TC_RC_TC_TM_P_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_MUX_TC_RC_Bits.TC_TM_P */
#define IFX_MINIMCDS_MUX_TC_RC_TC_TM_P_OFF (15u)

/** \brief Length for Ifx_MINIMCDS_MUX_TC_RC_Bits.RC */
#define IFX_MINIMCDS_MUX_TC_RC_RC_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_MUX_TC_RC_Bits.RC */
#define IFX_MINIMCDS_MUX_TC_RC_RC_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_MUX_TC_RC_Bits.RC */
#define IFX_MINIMCDS_MUX_TC_RC_RC_OFF (24u)

/** \brief Length for Ifx_MINIMCDS_MUX_TC_RC_Bits.RC_P */
#define IFX_MINIMCDS_MUX_TC_RC_RC_P_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_MUX_TC_RC_Bits.RC_P */
#define IFX_MINIMCDS_MUX_TC_RC_RC_P_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_MUX_TC_RC_Bits.RC_P */
#define IFX_MINIMCDS_MUX_TC_RC_RC_P_OFF (27u)

/** \brief Length for Ifx_MINIMCDS_FIFONOW_Bits.NOW */
#define IFX_MINIMCDS_FIFONOW_NOW_LEN (8u)

/** \brief Mask for Ifx_MINIMCDS_FIFONOW_Bits.NOW */
#define IFX_MINIMCDS_FIFONOW_NOW_MSK (0xffu)

/** \brief Offset for Ifx_MINIMCDS_FIFONOW_Bits.NOW */
#define IFX_MINIMCDS_FIFONOW_NOW_OFF (5u)

/** \brief Length for Ifx_MINIMCDS_FIFOBOT_Bits.BOTTOM */
#define IFX_MINIMCDS_FIFOBOT_BOTTOM_LEN (3u)

